# Chapter 6

In [1]:
import pandas as pd
import numpy as np

In [2]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
df = pd.read_csv('examples/ex1.csv')

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [8]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
names = ['a', 'b', 'c', 'd', 'message']

In [10]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [11]:
!cat examples/csv_mindex.csv

parsed = pd.read_csv('examples/csv_mindex.csv', 
                     index_col=['key1', 'key2'])

parsed

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [12]:
In [20]: list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [13]:
result = pd.read_table('examples/ex3.txt', sep='\\s+')

In [14]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [15]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [16]:
pd.read_csv('examples/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
!cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [18]:
result = pd.read_csv('examples/ex5.csv')

In [19]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [20]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [21]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [22]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [23]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [24]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [25]:
pd.options.display.max_rows= 10

In [26]:
result = pd.read_csv('examples/ex6.csv')

In [27]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [28]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [29]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [30]:
chunker

In [31]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [32]:
tot = pd.Series([]) 
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)

In [33]:
tot

key
E    368
X    364
L    346
O    343
Q    340
    ...
5    157
2    152
0    151
9    150
1    146
Length: 36, dtype: object

In [34]:
data = pd.read_csv('examples/ex5.csv')

In [35]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [36]:
data.to_csv('examples/out.csv')

In [37]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [38]:
import sys

In [39]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [40]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [41]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [42]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [43]:
dates = pd.date_range('1/1/2000', periods=7)

In [44]:
ts = pd.Series(np.arange(7), index=dates)

In [45]:
ts.to_csv('examples/tseries.csv')

In [46]:
!cat examples/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [47]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [48]:
import csv

In [49]:
f = open('examples/ex7.csv')

In [50]:
reader = csv.reader(f)

In [51]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [52]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [53]:
header, values = lines[0], lines[1:]

In [54]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [55]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [56]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar ='"'
    quoting = csv.QUOTE_MINIMAL

In [57]:
with open('examples/ex7.csv') as f:
    reader = csv.reader(f, dialect=my_dialect)
    reader = csv.reader(f, delimiter='|')

In [58]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect) 
    writer.writerow(('one', 'two', 'three')) 
    writer.writerow(('1', '2', '3')) 
    writer.writerow(('4', '5', '6')) 
    writer.writerow(('7', '8', '9'))

In [59]:
#JSON OBJECT EXAMPLE

obj = """
    {"name": "Wes",
     "places_lived": ["United States", "Spain", "Germany"],
     "pet": null,
     "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
                  {"name": "Katie", "age": 38,
                   "pets": ["Sixes", "Stache", "Cisco"]}]
} """

In [60]:
import json

In [61]:
result = json.loads(obj)

In [62]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [63]:
asjson = json.dumps(result)

In [64]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [65]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [66]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [67]:
data = pd.read_json('examples/example.json')

In [68]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [69]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [70]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [71]:
conda install lxml

Channels:
 - defaults
 - conda-forge
Platform: osx-arm64
Collecting package metadata (repodata.json): done
Solving environment: done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [72]:
pip install beautifulsoup4 html5lib

Requirement already satisfied: beautifulsoup4 in /Users/nathan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (4.12.3)
Requirement already satisfied: html5lib in /Users/nathan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (1.1)
Requirement already satisfied: soupsieve>1.2 in /Users/nathan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from beautifulsoup4) (2.5)
Requirement already satisfied: six>=1.9 in /Users/nathan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in /Users/nathan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from html5lib) (0.5.1)
Note: you may need to restart the kernel to use updated packages.

In [73]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [74]:
len(tables)

1

In [75]:
failures = tables[0]

In [76]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [77]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [78]:
close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, Length: 15, dtype: int64

In [79]:
from lxml import objectify

In [80]:
path = 'examples/Performance_MNR.xml'

#path = fd={'examples/mta_perf/Performance_MNR.xml'}

#this worked the first time I tried it but error now.

In [81]:
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [82]:
data = []

In [83]:
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ', 'DESIRED_CHANGE', 'DECIMAL_PLACES']

In [84]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [85]:
perf = pd.DataFrame(data)

In [86]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [87]:
dataframe=pd.DataFrame()
#Empty DataFrame

In [88]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [89]:
root

In [90]:
root.get('href')

'http://www.google.com'

In [91]:
root.text

'Google'

In [92]:
frame = pd.read_csv('examples/ex1.csv')

In [93]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [94]:
frame.to_pickle('examples/frame_pickle')

In [95]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [96]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [97]:
conda install pytables

Channels:
 - defaults
 - conda-forge
Platform: osx-arm64
Collecting package metadata (repodata.json): done
Solving environment: done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [98]:
store = pd.HDFStore('mydata.h5')

In [99]:
store['obj1'] = frame

In [100]:
store['obj1_col'] = frame['a']

In [101]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [102]:
store['obj1']

           a
0   0.762995
1   0.811161
2  -0.212283
3   0.049031
4   0.184935
..       ...
95 -0.862888
96 -0.704932
97  1.370236
98  1.465090
99 -1.889925

[100 rows x 1 columns]

In [103]:
store.put('obj2', frame, format='table')

In [104]:
store.select('obj2', where=['index >=10 and index <=15'])

           a
10 -0.087039
11 -0.626384
12 -0.708156
13 -0.218226
14 -0.625631
15 -0.881805

In [105]:
store.close()

In [106]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

/var/folders/9f/51kqfykj067ddd68rlj_8mv40000gp/T/ipykernel_63376/1098501470.py:1: FutureWarning: Starting with pandas version 3.0 all arguments of to_hdf except for the argument 'path_or_buf' will be keyword-only.
  frame.to_hdf('mydata.h5', 'obj3', format='table')

In [107]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  0.762995
1  0.811161
2 -0.212283
3  0.049031
4  0.184935

In [108]:
pip install xlrd

Requirement already satisfied: xlrd in /Users/nathan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [109]:
pip install openpyxl

Requirement already satisfied: openpyxl in /Users/nathan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in /Users/nathan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [110]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [111]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [112]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [113]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [114]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [115]:
frame.to_excel(writer, 'Sheet1')

/var/folders/9f/51kqfykj067ddd68rlj_8mv40000gp/T/ipykernel_63376/884453241.py:1: FutureWarning: Starting with pandas version 3.0 all arguments of to_excel except for the argument 'excel_writer' will be keyword-only.
  frame.to_excel(writer, 'Sheet1')

In [116]:
#writer.save()
df.to_excel('examples/ex2.xlsx', sheet_name='Sheet1', index=False)

In [117]:
frame.to_excel('examples/ex2.xlsx')

In [118]:
import requests

In [119]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [120]:
resp = requests.get(url)

In [121]:
resp

In [122]:
data = resp.json()

In [123]:
data[0]['title']

"BUG: Segfault when calling df.to_json(orient='records') and numpy.datetime64 being serialized"

In [124]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])

In [125]:
issues

,number,title,labels,state
0,58160,BUG: Segfault when calling df.to_json(orient='...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
1,58159,BUG: True cannot be cast to bool,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
2,58157,DEPR: Categorical fastpath,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
3,58156,BUG: Fix read_parquet not working with data ty...,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
4,58155,ENH: Add support for reading value labels from...,"[{'id': 104865385, 'node_id': 'MDU6TGFiZWwxMDQ...",open
...,...,...,...,...
25,58123,ENH: adding jsonline output format,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
26,58122,DEPR: keyword-only arguments for DataFrame/Ser...,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
27,58121,BUG: Timestamp.unit now reflects changes in co...,"[{'id': 3713792788, 'node_id': 'LA_kwDOAA0YD87...",open
28,58120,BUG: to_datetime timestamp parsing in 2.x,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,58117,PERF: groupby returns a RangeIndex from groups...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open

In [126]:
import sqlite3

In [127]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER);"""

In [128]:
con = sqlite3.connect('mydata.sqlite')

In [129]:
con.execute(query)

OperationalError: table test already exists

In [130]:
data = [('Atlanta', 'Georgia', 1.25, 6),
       .....:         ('Tallahassee', 'Florida', 2.6, 3),
       .....:         ('Sacramento', 'California', 1.7, 5)]

In [131]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [132]:
con.executemany(stmt, data)

In [133]:
con.commit()

In [134]:
cursor = con.execute('select * from test ')

In [135]:
rows = cursor.fetchall()

In [136]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [137]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [138]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5

In [153]:
conda install sqlalchemy
#NEEDED TO DO THIS ***WITHOUT THE ALIAS*** WITHOUT "AS"*** - THEN IMPORT BELOW.

SyntaxError: invalid syntax (4196512657.py, line 1)

In [154]:
import sqlalchemy as sqla

In [155]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [156]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5